
export const systemSections = [
  {
    id: 1,
    title: "等級",
    description: "最高等級與冒險等級相同，升級需消耗經驗。"
  },
  {
    id: 2,
    title: "Rank",
    description: "每裝備滿6個裝備，即可升Rank，Rank不同，所需的裝備不同。"
  },
  {
    id: 3,
    title: "星數",
    description: "透過收集足夠記憶碎片，可升級角色星數，若角色有六星形態，則需額外50純淨記憶碎片以及100公主寶珠，並通過六星解放關卡，通過後即可六星開花。"
  },
  {
    id: 4,
    title: "專武1",
    description: "部分角色有專武1，強化角色技能用，升級專武需角色記憶碎片以及公主之心(碎片)"
  },
  {
    id: 5,
    title: "專武2",
    description: "少部分角色有專武2，強化技能用，升級需角色純淨記憶碎片。"
  },
  {
    id: 6,
    title: "EX裝備",
    description: "角色額外的裝備，分為一般及戰隊戰兩種。"
  }
];

export const starUpTable = [
  { id: 1, from: 1, to: 2, cost: "30片" },
  { id: 2, from: 2, to: 3, cost: "100片" },
  { id: 3, from: 3, to: 4, cost: "120片" },
  { id: 4, from: 4, to: 5, cost: "150片" },
  { id: 5, from: 5, to: 6, cost: "50片(部分只能用母豬石母的25片)、該角色純淨碎片(vh關卡)50片、公主寶珠100顆" }
];

export const commonQuestions = [
  {
    id: 1,
    question: "新手要做什麼？",
    answer: "努力存碎片和鑽石，慢慢升星升等，不要急，新手養成大約需要半年，才可以滿等。"
  },
  {
    id: 2,
    question: "角色升星優先順序？",
    answer: "查看角色養成中的六星順序，一般來說，新手初期都先把表上A以上的角色升到五星，再按照六星順序慢慢一個一個升上六星。"
  },
  {
    id: 3,
    question: "哪些角色值得用女神的秘石買記憶碎片來升星？",
    answer: "基本上，能刷到的就不要用買的，花時間慢慢刷，因為女神的秘石有限，請把他們用在必要的限定角色上。"
  },
  {
    id: 4,
    question: "專武球何時使用？",
    answer: "基本上，都是給限定角色使用，尤其是能六星開花的限定角色，因為這些角色你還要額外買50個記憶碎片才能六星開花，而記憶碎片越後面越貴，能省女神石就省。"
  },
  {
    id: 5,
    question: "等級球何時使用？",
    answer: "初期就拿去給未來必定會用到的角色使用，不用猶豫，詳情角色參考其他頁面。"
  },
  {
    id: 6,
    question: "怎麼加速養成？",
    answer: "目前有同步系統，只要超過20隻同等同rank(超過RANK7)，其他角色都可以免費升到對應等級和"
  }
];
