
export const newbieRecommendations = [
  {
    id: 1,
    content: "主線3-1後可以借一隻好友的角色，新手建議抱滿等玩家的大腿(用滿等玩家的角色推圖即可，不用放自己的角色，反而會死)推薦是借六星的克莉絲緹娜(克總)一路輾"
  },
  {
    id: 2,
    content: "原則上(公主)競技場商店和戰隊商店都是新手非常重要的碎片來源，記得要天天買好，盡快練好這些能用又平民的角色，度過快樂輕鬆的新手期!"
  },
  {
    id: 3,
    content: "72小時公主祭:新手剛開始遊戲會有一個新手本人獨有的公主祭卡池，一律建議抽爆，推薦是去支線跟主線挖礦然後把那些人權角(厄、默涅、涅妃、菲歐)抽到有為止。(沒體力可以用)"
  },
  {
    id: 4,
    content: "新手到2xx等前，有新手掉落加倍(Normal/Hard/VeryHard)，但沒有調查掉落加倍，所以有調查加倍活動時，請花體力打，進入中期(100~200等)後，會很缺公主之心和公主寶珠。"
  },
  {
    id: 5,
    content: "後續什麼卡池要抽，基本上目前新出的角色都很強，由於剛入坑的資源很多，建議新出的都可以抽。復刻部分，戰隊戰重要以上角色個人覺得也可以抽。"
  },
  {
    id: 6,
    content: "小屋體力要領，生產體力道具要升級，每十等可以升一級。"
  },
  {
    id: 7,
    content: "加一個戰隊，可以上巴哈公連子版找，打戰隊戰領取獎勵，除了鑽石以外，戰隊幣也可以在商店購買角色碎片，加速養成速度。"
  }
];

export const newbieCautions = [
  {
    id: 1,
    content: "新手小心絕對、絕對不要拿女神的秘石(母豬石)亂買，尤其是六星的純淨碎片!!!部分強的角色其實可以先維持在三星即可，五星跟三星對新手來說相差不大"
  },
  {
    id: 2,
    content: "六星解放:湊齊升上六星所需資源後，你的角色並不會直接六星，而是會解鎖一個六星解放關卡，打過了才可以六星。而各解放關卡難度不一，有些難到新手根本打不過(最簡單的六星關卡等級為130，約75等可過)，請參照自身能力自行斟酌，對新手來說升上六星所需的公主寶珠相當珍貴，丟了又打不過豈不虧大"
  },
  {
    id: 3,
    content: "務必善用專武球，某些角色養成困難可以節省資源(會在角色說明欄註明)"
  },
  {
    id: 4,
    content: "一池保底200抽，需要30000鑽，沒保底不要下池，避免鑽石打水漂。"
  },
  {
    id: 5,
    content: "女神的秘石(母豬石)只用在刷不到的角色，可以的話等滿等後再使用，因為你現在用了，可能該角色在你滿等時已經用不到了。"
  },
  {
    id: 6,
    content: "阿斯特賴亞戒指(突破戒指)，是滿等後可以使用，也是用在不可刷的角色，尤其建議是常駐不可刷的，因為常駐不可刷的角色突破要120碎片，限定的只要40。限定的用母豬石買比較便宜。"
  }
];

export const referenceSites = [
  {
    id: 1,
    name: "巴哈公連版",
    url: "https://forum.gamer.com.tw/B.php?bsn=30861"
  },
  {
    id: 2,
    name: "煌靈",
    url: "https://www.youtube.com/@LongTimeNoC"
  }
];
